outputs/openfoam_backup/0003/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            -0.66;

seaLevelAsReference true;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            irregular;
    spectrum            JONSWAP;
    N                   200;
    Tsoft               24;
    Hs                  5.97;
    Tp                  27.45;
    gamma               3.3;
    depth               14.1;
    direction           ( 1 0 0 );
    spectramValues  nonuniform List<scalar> 
201
(
19.2943
30.5275
43.814
62.8517
92.9597
132.168
166.323
184.046
...
)
;

    fspectrum       nonuniform List<scalar> 
201
(
0.0277778
0.0292802
0.030737
0.0321038
0.0333392
0.0344057
0.0352707
0.0359081
...
)
;

    amplitude           nonuniform List<scalar>
    200
    (
        0.273593
        0.329087
        0.381833
        0.438738
        0.489982
        0.508142
        0.472564
        0.441224
...
    );
    frequency           nonuniform List<scalar>
    200
    (
        0.028529
        0.0300086
        0.0314204
        0.0327215
        0.0338725
        0.0348382
        0.0355894
        0.036169
...
    );
    phaselag            nonuniform List<scalar>
    200
    (
        1.12089
        2.51125
        1.04677
        1.3328
        0.389154
        0.340234
        1.73206
        0.300068
...
    );
    waveNumber          nonuniform List<vector>
    200
    (
        (0.0153596 0 0)
        (0.0161696 0 0)
        (0.0169444 0 0)
        (0.0176601 0 0)
        (0.0182947 0 0)
        (0.0188283 0 0)
        (0.019244 0 0)
        (0.0195652 0 0)
...
    );

    frequencyAxis
    {
        discretisation      cosineStretchedFrequencyAxis;
        lowerFrequencyCutoff 0.0277778;
        upperFrequencyCutoff 0.25;
        writeSpectrum       true;
    }

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 -1 );
        endX                ( 400 0 1 );
        orientation         ( 1 0 0 );
        fieldNames          ( alpha.water U );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               24;
}



// ************************************************************************* //
